tap "supabase/tap"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# User-friendly launcher for Bazel
brew "bazelisk"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Blazing fast, portable and modular toolkit for Ethereum application development
brew "foundry"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Next-gen compiler infrastructure
brew "llvm"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Open-source, cross-platform JavaScript runtime environment
brew "node@22"
# Send things to pastebin from the command-line
brew "pastebinit"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# PNG image optimizing utility
brew "pngquant"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Develop and deploy code with zero configuration
brew "railway"
# Rust toolchain installer
brew "rustup"
# SOcket CAT: netcat on steroids
brew "socat"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line client for WebSockets
brew "websocat"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Tool to create native applications from command-line scripts
cask "platypus"
vscode "alexanderbast.vscode-snazzy"
vscode "anysphere.remote-ssh"
vscode "eamodio.gitlens"
vscode "rust-lang.rust-analyzer"
cargo "avm"
cargo "cargo-autoinherit"
cargo "cargo-binstall"
cargo "cargo-component"
cargo "cargo-expand"
cargo "cargo-nextest"
cargo "cargo-sort"
cargo "cargo-udeps"
cargo "mdbook"
cargo "mdbook-alerts"
cargo "mdbook-autosummary"
cargo "mdbook-linkcheck"
cargo "mdbook-mermaid"
cargo "rialoman"
cargo "teerex"
cargo "wasm-bindgen-cli"
cargo "wasm-pack"
cargo "wasm-tools"
npm "@anthropic-ai/claude-code"
npm "@openai/codex"
npm "localtunnel"
npm "pnpm"
