tap "supabase/tap"
brew "bash"
brew "caddy"
brew "openssl@3"
brew "cocoapods"
brew "docker"
brew "gh"
brew "git"
brew "git-delta"
brew "imagemagick"
brew "jq"
brew "llvm"
brew "node"
brew "node@22"
brew "pastebinit"
brew "pkgconf"
brew "pngquant"
brew "poppler"
brew "python@3.14"
brew "railway"
brew "rustup"
brew "socat"
brew "swiftlint"
brew "tesseract"
brew "tree"
brew "websocat"
brew "xcodegen"
brew "yq"
brew "supabase/tap/supabase"
cask "docker-desktop"
cask "git-credential-manager"
cask "platypus"
vscode "alexanderbast.vscode-snazzy"
vscode "anysphere.remote-ssh"
vscode "eamodio.gitlens"
vscode "rust-lang.rust-analyzer"
npm "@anthropic-ai/claude-code"
npm "@openai/codex"
npm "localtunnel"
npm "pnpm"
